function [ST] = scenario_generator(scenario_num)
% 1: 信号灯位置 2： 周期 3： 红灯时间 4： 偏置
switch(scenario_num)
    case 1
%         load("res_10_3_2_1_3_0.mat")%s1
%         load("energy_sum_10_3_2_1_3_0.mat")%s1
        ST{1}=[500 1000 1500 2000 2500 3000 3500];
        ST{2}=ones(1,length(ST{1})-1)*70;
        ST{3} = ones(1,length(ST{1})-1)*40;
    case 2
%         load("res_10_2_2.mat")%s2
%         load("energy_sum_10_2_2.mat")%s2
        ST{1} = (100:100:1000)*5;
        ST{2} = ones(1,length(ST{1})-1)*70;% 周期
        ST{3} = ones(1,length(ST{1})-1)*40;% 红区
    case 3
%         load("res_10_3_2_1_0_1.mat")%s3
%         load("energy_sum_10_3_2_1_0_1.mat")%s3
        ST{1}=[500 1000 1500 2000 2500 3000 3500];
        ST{2}=[60 70 80 60 70 80 ];
        ST{3}=[30 40 40 30 40 50 ];
    case 4
%         load("res_10_5_1_2.mat")%s4
%         load("energy_sum_10_5_1_2.mat")%s4
        ST{1} = (100:100:1000)*5;
        ST{2}=[60 70 80 60 70 80 90 70 60];
        ST{3}=[30 40 40 30 40 50 60 40 30];
    case 5
%         load("res_10_3_2_0_1.mat")%s5
%         load("energy_sum_10_3_2_0_1.mat")%s5
        % ST{1}=[800 1100 1400 1800 2300 2800 3500 ];%备选
        ST{1}=[500 1100 1400 1800 2300 2900 3500 ];
        ST{2}=[60 70 80 60 70 80 ];
        ST{3}=[30 40 40 30 40 50 ];
    case 6
%         load("res_10_5_1_1_6.mat")%s6
%         load("energy_sum_10_5_1_1_6.mat")%s6
        %ST{1}=[500 900 1200 1800 2600 3100 3800 4200 4600 5000];
        ST{1}=[500 800 1200 1600 2000 2400 3000 3500 4500 5000];
        ST{2}=[60 70 80 60 70 80 90 70 60];
        ST{3}=[30 40 40 30 40 50 60 40 30];
end

ST{4} = [50 0 50 10 40 20 0 10 45 20]; % 偏置
end

